students = [{'name': 'Никита', 
            'second_name': 'Михайлов', 
            'age': 31, 
            'average_score' : 5},
            {'name': 'Павел', 
            'second_name': 'Иванов', 
            'Вage': 28, 
            'average_score' : 4},
            {'name': 'Мария', 
            'second_name': 'Ушакова', 
            'age': 29, 
            'average_score' : 3}
            ]


news = [{'title':'«Ведомости»: турецкие банки начали закрывать счета российским компаниям',
        'content':'''Некоторые турецкие банки начали закрывать счета компаниям из РФ и усложнили\n 
        требования к физическим лицам, открывающим банковские карты, сообщает газета'''
        },
        {'title':'МИД Израиля сообщил, что добился освобождения музыкантов «Би-2» в Таиланде',
        'content':'''Все задержанные в Таиланде члены рок-группы «Би-2» в результате содействия\n
          израильских дипломатов освобождены и вылетели в Израиль, сообщила 31 января \n
          пресс-служба МИД еврейского государства'''}]

